In [1]:
!pip install nltk

Requirement already satisfied: nltk in /usr/local/lib/python3.6/dist-packages (3.2.5)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from nltk) (1.15.0)

In [5]:
import nltk
import sqlite3
import pandas as pd
import csv

In [36]:
conn = sqlite3.connect("tweets_data.db")
cur = conn.cursor()
table_name = "nov_01"
cur.execute("DROP TABLE IF EXISTS " + table_name)
cur.execute("CREATE TABLE " + table_name +  " (retweeted_id INTEGER, user_id INTEGER);")

nov_01 = pd.read_csv("/content/drive/MyDrive/HoyaHacks 2021/2020-11-01.csv")
nov_01.to_sql("nov_01", conn, if_exists='append', index=False)

pd.read_sql('''SELECT * FROM nov_01 ORDER BY ROWID ASC LIMIT 10''', conn)
cur.execute("SELECT retweeted_id, COUNT(user_id) FROM nov_01 GROUP BY retweeted_id")
pd.read_sql('''SELECT retweeted_id, COUNT(user_id) FROM nov_01 GROUP BY retweeted_id ORDER BY COUNT(user_id) DESC LIMIT 100''', conn)

           retweeted_id  COUNT(user_id)
0   1322654727390158850            2477
1   1322949336687386624            2253
2   1322903253932191744            2114
3   1322639351659012099            1716
4   1322701497633746944            1488
..                  ...             ...
95  1322773331519614976             150
96  1323023924108627969             149
97  1322682122608529408             147
98  1322692332764995584             145
99  1322916847646244864             143

[100 rows x 2 columns]

In [ ]:
https://stackoverflow.com/questions/7887011/how-to-drop-a-table-if-it-exists
https://stackoverflow.com/questions/1650946/mysql-create-table-if-not-exists-error-1050
https://www.sqlitetutorial.net/sqlite-create-table/
https://stackoverflow.com/questions/2887878/importing-a-csv-file-into-a-sqlite3-database-table-using-python
https://www.sqlitetutorial.net/sqlite-python/creating-database/
https://www.sqlitetutorial.net/sqlite-group-by/